# 미션

## Part 1: 판다스 기초

### 미션 1-1

In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

### 미션 1-2

In [2]:
a = {'김철수': 85,'이영희': 92,'박민수': 78,'최지연': 96}
b = pd.Series(a)
print(b)

김철수    85
이영희    92
박민수    78
최지연    96
dtype: int64

### 미션 1-3 (심화)

In [3]:
print(a['이영희'])

c = b[b >= 90] 
print(c)

d = b + 5
print(d)

92
이영희    92
최지연    96
dtype: int64
김철수     90
이영희     97
박민수     83
최지연    101
dtype: int64

## Part 2: DataFrame 마스터하기

### 미션 2-1

In [ ]:
import pandas as pd

data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}
df = pd.DataFrame(data)
print(df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   성별      4 non-null      object
 3   점수      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes
None
              나이         점수
count   4.000000   4.000000
mean   20.000000  87.750000
std     0.816497   7.932003
min    19.000000  78.000000
25%    19.750000  83.250000
50%    20.000000  88.500000
75%    20.250000  93.000000
max    21.000000  96.000000
(4, 4)
    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
0    85
1    92
2    78
3    96
Name: 점수, dtype: int64

### 미션 2-2

In [ ]:
print(df.info())
print(df.describe())
print(df.shape)

print(df.head(2))

print(df['점수'])

## Part 3: 데이터 조작과 필터링

### 미션 3-1

In [10]:
print(df.loc[1])

print(df.iloc[[0, 2], [0, 3]])


age = df[df['나이'] >= 20]
print(age)

이름    이영희
나이     19
성별      여
점수     92
Name: 1, dtype: object
    이름  점수
0  김철수  85
2  박민수  78
    이름  나이 성별  점수
0  김철수  20  남  85
2  박민수  21  남  78
3  최지연  20  여  96

### 미션 3-2

In [11]:

df.loc[4] = ['정민호', 22, '남자', 88]

df['점수'] += 3
print(df)

    이름  나이  성별  점수
0  김철수  20   남  88
1  이영희  19   여  95
2  박민수  21   남  81
3  최지연  20   여  99
4  정민호  22  남자  91

In [12]:
def grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B+'
    else:
        return 'C'

df['등급'] = df['점수'].apply(grade)
display(df)

    이름  나이  성별  점수  등급
0  김철수  20   남  88  B+
1  이영희  19   여  95   A
2  박민수  21   남  81  B+
3  최지연  20   여  99   A
4  정민호  22  남자  91   A

## Part 4: 실전 데이터 분석

In [56]:
import pandas as pd

# 샘플 데이터 생성
sales_data = {
    '주문번호': ['ORD001', 'ORD002', 'ORD003', 'ORD004', 'ORD005', 'ORD006'],
    '고객명': ['김철수', '이영희', '박민수', '김철수', '최지연', '이영희'],
    '상품명': ['노트북', '마우스', '키보드', '모니터', '노트북', '스피커'],
    '가격': [1200000, 25000, 80000, 300000, 1350000, 120000],
    '수량': [1, 2, 1, 1, 1, 1],
    '주문일': ['2024-01-15', '2024-01-16', '2024-01-16', '2024-01-17', '2024-01-17', '2024-01-18']
}

df_sales = pd.DataFrame(sales_data)

display(df_sales)

     주문번호  고객명  상품명       가격  수량         주문일
0  ORD001  김철수  노트북  1200000   1  2024-01-15
1  ORD002  이영희  마우스    25000   2  2024-01-16
2  ORD003  박민수  키보드    80000   1  2024-01-16
3  ORD004  김철수  모니터   300000   1  2024-01-17
4  ORD005  최지연  노트북  1350000   1  2024-01-17
5  ORD006  이영희  스피커   120000   1  2024-01-18

### 미션 4-1 (종합 프로젝트)

In [57]:
df_sales['매출액'] = df_sales['가격'] * df_sales['수량']
total = sum(df_sales['매출액'])

print(total)

3100000

In [58]:
order_counts = df_sales['고객명'].value_counts()
print("고객별 주문 횟수")
print(order_counts)
print()

total_quantity = df_sales.groupby('고객명')['수량'].agg(['sum'])
print("고객별 총 구매금액")
print(customer_sales)

고객별 주문 횟수
고객명
김철수    2
이영희    2
박민수    1
최지연    1
Name: count, dtype: int64

고객별 총 구매금액
고객명
김철수    1500000
박민수      80000
이영희     170000
최지연    1350000
Name: 매출액, dtype: int64

In [59]:
top = df_sales['상품명'].value_counts()
print(top.index[0])

노트북

In [60]:
daily_sales = df_sales.groupby('주문일')['매출액'].sum().sort_index()
print(daily_sales)

주문일
2024-01-15    1200000
2024-01-16     130000
2024-01-17    1650000
2024-01-18     120000
Name: 매출액, dtype: int64

In [64]:
high_sales = df_sales.query("매출액 >= 100000")
print(high_sales)

     주문번호  고객명  상품명       가격  수량         주문일      매출액
0  ORD001  김철수  노트북  1200000   1  2024-01-15  1200000
3  ORD004  김철수  모니터   300000   1  2024-01-17   300000
4  ORD005  최지연  노트북  1350000   1  2024-01-17  1350000
5  ORD006  이영희  스피커   120000   1  2024-01-18   120000

## 심화 미션 1: 결측치 처리

In [66]:
import numpy as np

# 결측치가 있는 데이터
messy_data = {
    '이름': ['A', 'B', 'C', 'D', 'E'],
    '나이': [25, np.nan, 30, 28, np.nan],
    '점수': [85, 90, np.nan, 95, 88]
}

df_messy = pd.DataFrame(messy_data)

display(df_messy)

  이름    나이    점수
0  A  25.0  85.0
1  B   NaN  90.0
2  C  30.0   NaN
3  D  28.0  95.0
4  E   NaN  88.0

In [ ]:
print(df_messy.isnull()) #df에서 결측치가 있으면 True로 표기하라

      이름     나이     점수
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

In [73]:
age_mean = df_messy['나이'].mean()
df_messy['나이'] = df_messy['나이'].fillna(age_mean)
print(df_messy)

  이름         나이    점수
0  A  25.000000  85.0
1  B  27.666667  90.0
2  C  30.000000   NaN
3  D  28.000000  95.0
4  E  27.666667  88.0

In [79]:
score = df_messy['점수'].median()
df_messy['점수'] = df_messy['점수'].fillna(score)
print(df_messy)

  이름         나이    점수
0  A  25.000000  85.0
1  B  27.666667  90.0
2  C  30.000000  89.0
3  D  28.000000  95.0
4  E  27.666667  88.0

### 심화 미션 2: 데이터 병합

In [80]:
# 학생 기본정보
students = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '이름': ['김철수', '이영희', '박민수'],
    '학과': ['컴퓨터공학', '통계학', '경영학']
})

# 학생 성적정보
scores = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '수학': [85, 92, 78],
    '영어': [88, 85, 90]
})

In [83]:
df_end = pd.merge(students, scores, on='학번')
display(df_end)

     학번   이름     학과  수학  영어
0  S001  김철수  컴퓨터공학  85  88
1  S002  이영희    통계학  92  85
2  S003  박민수    경영학  78  90